demonstracoes/delphi/Win32/Debug/Templates/vm50a/PE/consulta_dest.soap

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope"><soap:Header><nfeCabecMsg xmlns="http://www.portalfiscal.inf.br/nfe/wsdl/NfeConsultaDest"><cUF>%s</cUF><versaoDados>1.01</versaoDados></nfeCabecMsg></soap:Header><soap:Body><nfeDadosMsg xmlns="http://www.portalfiscal.inf.br/nfe/wsdl/NfeConsultaDest">%s</nfeDadosMsg></soap:Body></soap:Envelope>